# Pandas

In [1]:
import pandas as pd

## Series

In [2]:
series1=pd.Series([1,2,3,4,5])
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
import numpy as np
series12=pd.Series(np.arange(0,10))
series12

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [4]:
type(series1)

pandas.core.series.Series

In [30]:
series1=pd.Series(['karthick','kumaran','rajan','kumari'],index=['r1','r2','r3','r4'])
series1

r1    karthick
r2     kumaran
r3       rajan
r4      kumari
dtype: object

In [6]:
series1.values

array(['karthick', 'kumaran', 'rajan', 'kumari'], dtype=object)

In [7]:
series1.index

Index(['r1', 'r2', 'r3', 'r4'], dtype='object')

In [9]:
series1['r2']

'kumaran'

In [10]:
series1['r1':'r3']

r1    karthick
r2     kumaran
r3       rajan
dtype: object

In [11]:
series1.index[0]
# series1.index['r1'] it geve err

'r1'

In [32]:
series1[0]

'karthick'

In [14]:
series1.index[0:3:2]

Index(['r1', 'r3'], dtype='object')

In [16]:
#in default
print(series1.index.name)

None

In [17]:
series1.index.name="reg number"
series1

reg number
r1    karthick
r2     kumaran
r3       rajan
r4      kumari
dtype: object

In [18]:
series1.index.name

'reg number'

In [ ]:
# we can not do like that
#series.index[2]='reg number'

In [20]:
series1.index=[1,2,3,4]
series1

1    karthick
2     kumaran
3       rajan
4      kumari
dtype: object

In [21]:
# we can create pandas series using dictionaryes
dic={'no1':'person1','no2':'person2'}
dic_series=pd.Series(dic)
dic_series

no1    person1
no2    person2
dtype: object

## DataFrame

In [24]:
#dataframe -2D labelled array,row and col index,tabular , structured data
df=pd.DataFrame([[1,'kumaran'],[2,'Karthick'],[3,'Rajan']])
df

   0         1
0  1   kumaran
1  2  Karthick
2  3     Rajan

In [25]:
df=pd.DataFrame(df,index=['a','b','c'],columns=['roll no','name'])
df
# funny thing use a another data frame to create a new data frame

   roll no  name
a      NaN   NaN
b      NaN   NaN
c      NaN   NaN

In [30]:
df1=pd.DataFrame(
    [[1,'person1'],[2,'person2'],[3,'person3'],[4,'person4']
    ],
    index=['a','b','c','d'],
    columns=['Reg no','Name']
)
print(df1)
df1

   Reg no     Name
a       1  person1
b       2  person2
c       3  person3
d       4  person4

   Reg no     Name
a       1  person1
b       2  person2
c       3  person3
d       4  person4

In [2]:
#DataFrame using Series
Se=pd.Series([1,2,3,4,5,6])
dfs=pd.DataFrame(Se)
dfs

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [4]:
#DataFrame using list of dictionary
pd.DataFrame([{'a':1,'b':2},{'c':3,'b':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  4  3.0

In [2]:
pd.DataFrame({'a':1,'b':2},{'c':3,'b':4})
# consider this behaviour

   a  b
c  1  2
b  1  2

Data Indexing in pandas

In [16]:
# Series
Se=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
Se

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
print(1 in Se)
print('a' in Se)
print(Se.keys())
print(list(Se.items()))
Se['e']=10
Se

False
True
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[('a', 1), ('b', 2), ('c', 3), ('d', 4), ('e', 5)]

a     1
b     2
c     3
d     4
e    10
dtype: int64

In [17]:
print(Se['a':'c'])
print(Se[0:3])
#masking
print(Se[Se>3])
#fancy indexing
# Se['a','e'] it give error
Se[['a','e']]

a    1
b    2
c    3
dtype: int64
a    1
b    2
c    3
dtype: int64
d    4
e    5
dtype: int64

a    1
e    5
dtype: int64

* loc
* iloc
* ix

In [17]:
# before we starting this we know about explicit indexing,and implicit indexing
# explicit acces a Series using the given key or index values
# implicit acces a Series using numerical index value

#it meet some problem at the below situation

data=pd.Series(['z','a','b'],index=[1,3,5])
print(data[1])
print(data[1:3])

z
3    a
5    b
dtype: object

In [26]:
#loc refere always explicite
print(data.loc[1:3])
data.loc[5]

1    z
3    a
dtype: object

'b'

In [27]:
#ilco refer always implicite
print(data.iloc[1:3])
data.iloc[2]

3    a
5    b
dtype: object

'b'

### Data Selection in DataFrame

In [6]:
# Dataframe using Seres

se1=pd.Series({'India':7899508,'U.S.A':578493,'china':33647383})
se2=pd.Series({'India':657489,'U.S.A':364758,'china':374995})

df2=pd.DataFrame({'area':se1,'pop':se2})

print(df2)

print(df2['area'])

print(df2.area)
# we can not use df2.pop becaues an built in method have DF like the same name 'pop'

           area     pop
India   7899508  657489
U.S.A    578493  364758
china  33647383  374995
India     7899508
U.S.A      578493
china    33647383
Name: area, dtype: int64
India     7899508
U.S.A      578493
china    33647383
Name: area, dtype: int64

Some basic functions in dataframe

In [31]:
df1.count()

Reg no    4
Name      4
dtype: int64

In [32]:
len(df)

3

In [34]:
df1.dtypes

Reg no     int64
Name      object
dtype: object

In [35]:
df1.shape

(4, 2)

In [36]:
df1.ndim

2

In [37]:
df1.size

8

In [38]:
df1.values

array([[1, 'person1'],
       [2, 'person2'],
       [3, 'person3'],
       [4, 'person4']], dtype=object)

In [39]:
type(df1.values)

numpy.ndarray

In [41]:
names=['MS Dhoni','virat kholi','R Sharma','S Yadhav']
strangth=['wicketkeeper','Batsman','Opener','allrounder']
position=[7,2,1,3]

my_dict={'Players':names,'Ablity':strangth,'Bating_Order':position}

my_team=pd.DataFrame(my_dict)

my_team

       Players        Ablity  Bating_Order
0     MS Dhoni  wicketkeeper             7
1  virat kholi       Batsman             2
2     R Sharma        Opener             1
3     S Yadhav    allrounder             3

In [42]:
my_team.index=['Cap','A Cap','P','Or']
my_team

           Players        Ablity  Bating_Order
Cap       MS Dhoni  wicketkeeper             7
A Cap  virat kholi       Batsman             2
P         R Sharma        Opener             1
Or        S Yadhav    allrounder             3

In [16]:
boston=pd.read_csv('boston.csv')
boston

,CRIM,ZN,INDUS,CHAS,NX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,11.9

In [44]:
boston.head()

,CRIM,ZN,INDUS,CHAS,NX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [45]:
boston.tail()

,CRIM,ZN,INDUS,CHAS,NX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,11.9

In [12]:
cars=pd.read_csv('cars.csv',index_col=0)
cars

       cars_per_cap\t          country \tdrives_right
\t
US\t              809  \tUnited States         \tTrue
AUS\t             731      \tAustralia        \tFalse
JAP\t             588          \tJapan        \tFalse
IN\t               18          \tIndia        \tFalse
RU\t              200       \tRussia\t           True
MOR\t              70        \tMorocco         \tTrue
EG\t               45          \tEgypt         \tTrue

In [4]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, US	 to EG
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   cars_per_cap	  7 non-null      int64
 1   country        7 non-null      object
 2   	drives_right  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [13]:
cars=cars.set_index(['country'])
cars

                 cars_per_cap\t \tdrives_right
country
\tUnited States             809         \tTrue
\tAustralia                 731        \tFalse
\tJapan                     588        \tFalse
\tIndia                      18        \tFalse
\tRussia\t                  200           True
\tMorocco                    70         \tTrue
\tEgypt                      45         \tTrue

In [14]:
cars.index

Index(['\tUnited States', '\tAustralia', '\tJapan', '\tIndia', '\tRussia\t',
       '\tMorocco', '\tEgypt'],
      dtype='object', name='country')

In [15]:
print(cars.index.name)

country

In [17]:
boston=boston.set_index(['CRIM','ZN'])
boston

,,INDUS,CHAS,NX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
CRIM,ZN,,,,,,,,,,,,
0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,22.4
0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,20.6
0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,23.9
0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,22.0
0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,11.9

In [22]:
print(boston.index.name)

print(boston.index.names)

Index
['CRIM', 'ZN']

In [23]:
boston.index.names=['Index1','Index2']

boston

,,INDUS,CHAS,NX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
Index1,Index2,,,,,,,,,,,,
0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,22.4
0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,20.6
0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,23.9
0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,22.0
0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,11.9

****

In [4]:
cars=pd.read_csv("cars.csv")
cars

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True
5        MOR            70        Morocco          True
6         EG            45          Egypt          True

In [5]:
cars=pd.read_csv("cars.csv",index_col=0)
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [6]:
cars.head()

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True

In [7]:
cars.tail()

     cars_per_cap  country  drives_right
JAP           588    Japan         False
IN             18    India         False
RU            200   Russia          True
MOR            70  Morocco          True
EG             45    Egypt          True

Hierarchical Indexing

In [4]:
stocks=pd.read_csv("stocks.csv",index_col=0)
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [5]:
stocks=stocks.set_index(['Symbol','Date'])
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [6]:
stocks.index

MultiIndex([('CSCO', '2016-10-03'),
            ('AAPL', '2016-10-03'),
            ('MSFT', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('MSFT', '2016-10-04'),
            ('CSCO', '2016-10-04'),
            ('MSFT', '2016-10-05'),
            ('CSCO', '2016-10-05'),
            ('AAPL', '2016-10-05')],
           names=['Symbol', 'Date'])

In [12]:
print(stocks.index.name)

None

In [13]:
print(stocks.index.names)

['Symbol', 'Date']

In [7]:
stocks=stocks.sort_index()
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [8]:
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

Dataset info and shape

In [9]:
stocks.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 9 entries, ('AAPL', '2016-10-03') to ('MSFT', '2016-10-05')
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Close   9 non-null      float64
 1   Volume  9 non-null      int64
dtypes: float64(1), int64(1)
memory usage: 534.0+ bytes

In [10]:
stocks.axes

[MultiIndex([('AAPL', '2016-10-03'),
             ('AAPL', '2016-10-04'),
             ('AAPL', '2016-10-05'),
             ('CSCO', '2016-10-03'),
             ('CSCO', '2016-10-04'),
             ('CSCO', '2016-10-05'),
             ('MSFT', '2016-10-03'),
             ('MSFT', '2016-10-04'),
             ('MSFT', '2016-10-05')],
            names=['Symbol', 'Date']),
 Index(['Close', 'Volume'], dtype='object')]

In [3]:
cars=pd.read_csv('cars.csv',index_col=0)
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [4]:
cars['country']

US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object

In [5]:
type(cars['country'])

pandas.core.series.Series

In [7]:
cars[['country','drives_right']]

           country  drives_right
US   United States          True
AUS      Australia         False
JAP          Japan         False
IN           India         False
RU          Russia          True
MOR        Morocco          True
EG           Egypt          True

In [8]:
type(cars[['country']])

pandas.core.frame.DataFrame

### Row Access

In [10]:
cars[2:5]

     cars_per_cap country  drives_right
JAP           588   Japan         False
IN             18   India         False
RU            200  Russia          True

In [11]:
#loc

cars.loc['IN']

cars_per_cap       18
country         India
drives_right    False
Name: IN, dtype: object

In [12]:
cars.loc[['IN','US','EG'],['country','drives_right']]

          country  drives_right
IN          India         False
US  United States          True
EG          Egypt          True

In [15]:
cars.loc[:,['country']]

           country
US   United States
AUS      Australia
JAP          Japan
IN           India
RU          Russia
MOR        Morocco
EG           Egypt

In [18]:
stocks=pd.read_csv('stocks.csv',index_col=['Symbol','Date']).sort_index()
stocks

                   Unnamed: 0   Close    Volume
Symbol Date
AAPL   2016-10-03           1  112.52  21701800
       2016-10-04           3  113.00  29736800
       2016-10-05           8  113.05  21453100
CSCO   2016-10-03           0   31.50  14070500
       2016-10-04           5   31.35  18460400
       2016-10-05           7   31.59  11808600
MSFT   2016-10-03           2   57.42  19189500
       2016-10-04           4   57.24  20085900
       2016-10-05           6   57.64  16726400

In [21]:
stocks.loc[('CSCO','2016-10-04')]

Unnamed: 0           5.00
Close               31.35
Volume        18460400.00
Name: (CSCO, 2016-10-04), dtype: float64

In [26]:
stocks.loc[[('CSCO','2016-10-04'),('MSFT','2016-10-03')],['Volume']]

                     Volume
Symbol Date
CSCO   2016-10-04  18460400
MSFT   2016-10-03  19189500

In [23]:
stocks.loc[(['AAPL','MSFT'],'2016-10-05'),:]

                   Unnamed: 0   Close    Volume
Symbol Date
AAPL   2016-10-05           8  113.05  21453100
MSFT   2016-10-05           6   57.64  16726400

In [27]:
stocks.loc[('CSCO',['2016-10-03','2016-10-05']),:]

                   Unnamed: 0  Close    Volume
Symbol Date
CSCO   2016-10-03           0  31.50  14070500
       2016-10-05           7  31.59  11808600

**iloc**

In [28]:
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [29]:
cars.iloc[1]

cars_per_cap          731
country         Australia
drives_right        False
Name: AUS, dtype: object

In [30]:
cars.iloc[[1]]

     cars_per_cap    country  drives_right
AUS           731  Australia         False

In [31]:
cars.iloc[[1,2,3]]

     cars_per_cap    country  drives_right
AUS           731  Australia         False
JAP           588      Japan         False
IN             18      India         False

In [32]:
cars.iloc[[1,2,3],[1,2]]

       country  drives_right
AUS  Australia         False
JAP      Japan         False
IN       India         False

In [33]:
cars.iloc[:4,:3]

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False

In [35]:
pop=pd.read_csv('brics.csv',index_col=0) 
pop

         country    capital    area  population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Delhi   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [36]:
pop['area']

BR     8.516
RU    17.100
IN     3.286
CH     9.597
SA     1.221
Name: area, dtype: float64

In [38]:
exp=pop['area']>8
exp

BR     True
RU     True
IN    False
CH     True
SA    False
Name: area, dtype: bool

In [39]:
pop['area']<13

BR     True
RU    False
IN     True
CH     True
SA     True
Name: area, dtype: bool

In [40]:
pop[exp]

   country   capital    area  population
BR  Brazil  Brasilia   8.516       200.4
RU  Russia    Moscow  17.100       143.5
CH   China   Beijing   9.597      1357.0

In [42]:
import numpy as np
exp=np.logical_and(pop["area"]>8,pop["area"]<10)
exp

BR     True
RU    False
IN    False
CH     True
SA    False
Name: area, dtype: bool

In [43]:
pop[np.logical_and(pop["area"]>8,pop["area"]<10)]

   country   capital   area  population
BR  Brazil  Brasilia  8.516       200.4
CH   China   Beijing  9.597      1357.0

Iteration

In [45]:
cars=pd.read_csv("cars.csv",index_col=0)
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [46]:
for val in cars:
    print(val)

cars_per_cap
country
drives_right

In [47]:
for lab,row in cars.iterrows():
    print(lab,"\t:\t",row['country'])

US 	:	 United States
AUS 	:	 Australia
JAP 	:	 Japan
IN 	:	 India
RU 	:	 Russia
MOR 	:	 Morocco
EG 	:	 Egypt

In [49]:
# add an column
for lab,row in cars.iterrows():
    cars.loc[lab,'COUNTRY']=row['country'].upper()
cars

     cars_per_cap        country  drives_right        COUNTRY
US            809  United States          True  UNITED STATES
AUS           731      Australia         False      AUSTRALIA
JAP           588          Japan         False          JAPAN
IN             18          India         False          INDIA
RU            200         Russia          True         RUSSIA
MOR            70        Morocco          True        MOROCCO
EG             45          Egypt          True          EGYPT

In [50]:
cars=pd.read_csv('cars.csv',index_col=0)

In [51]:
cars['COUNTRY']=cars['country'].apply(str.upper)
cars

     cars_per_cap        country  drives_right        COUNTRY
US            809  United States          True  UNITED STATES
AUS           731      Australia         False      AUSTRALIA
JAP           588          Japan         False          JAPAN
IN             18          India         False          INDIA
RU            200         Russia          True         RUSSIA
MOR            70        Morocco          True        MOROCCO
EG             45          Egypt          True          EGYPT

In [14]:
file='titanic.csv'
df=pd.read_csv(file)
df

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/521171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2.3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
data=pd.read_csv(file,nrows=5,header=None)
data_array=data.values
print(data_array)

[['PassengerId' 'Survived' 'Pclass' 'Sex' 'Age' 'SibSp' 'Parch' 'Ticket'
  'Fare' 'Cabin' 'Embarked']
 ['1' '0' '3' 'male' '22.0' '1' '0' 'A/521171' '7.2500' nan 'S']
 ['2' '1' '1' 'female' '38.0' '1' '0' 'PC17599' '71.2833' 'C85' 'C']
 ['3' '1' '3' 'female' '26.0' '0' '0' 'STON/O2.3101282' '7.9250' nan 'S']
 ['4' '1' '1' 'female' '35.0' '1' '0' '113803' '53.1000' 'C123' 'S']]

In [6]:
print(type(data_array))

<class 'numpy.ndarray'>

In [15]:
file='battledeath.xlsx'
xl=pd.ExcelFile(file)

print(xl.sheet_names)

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.